% 1、直接用多元二项式回归
x1=[1000 600 1200 500 300 400 1300 1100 1300 300] ;
x2=[5 7 6 6 8 7 5 4 3 9];y=[100 75 80 70 50 65 90 100 110 60]';
x=[x1'  x2' ];
rstool(x ,y,'purequadratic')  % 使用多元二项式回归工具箱进行回归分析
beta, rmse  % 回归系数和剩余标准差
% beta=110.5313   0.1464   -26.5709   -0.0001   1.8475 
% rmse=4.5362
% 故回归模型为：𝑦=110.5313+0.1464𝑥_1−26.5709𝑥_2−0.0001𝑥_1^2+1.8475𝑥_2^2
% 剩余标准差仅为4.5362，说明此回归模型的预测效果较好

% 2、化为多元线性回归
% 令x3=x1^2   x4=x2^2
X=[ones(10,1) x1' x2' (x1.^2)' (x2.^2)']; % 多元线性回归的自变量矩阵
[b,bint,r,rint,stats]=regress(y,X); % 进行多元线性回归分析
b,stats  % b为回归系数，stats为统计信息
% 结果为：
% b=110.5313     0.1464    -26.5709   -0.0001    1.8475
% stats=0.9702   40.6656   0.0005

